{
  "festivals": [
    {
      "title": "Lunar New Year",
      "imgRef": "festival_dragon",
      "sfx": "drum",
      "copy": "Every year, families celebrate the New Year together! Red lanterns light up the streets. Colorful dragons dance to loud drums. Children get red envelopes with lucky money inside. Everyone eats delicious food and watches fireworks light up the sky!"
    },
    {
      "title": "Dragon Boat Festival",
      "imgRef": "festival_boat",
      "sfx": "splash",
      "copy": "Long boats shaped like dragons race across the water! Teams paddle as fast as they can while drums beat loudly. People cheer from the shore. This festival remembers a brave poet from long ago. Families also eat special rice dumplings wrapped in bamboo leaves!"
    },
    {
      "title": "Mid-Autumn Festival",
      "imgRef": "festival_moon",
      "sfx": "chime",
      "copy": "When the moon is biggest and brightest, families gather together. They share round mooncakes filled with sweet paste. Children carry beautiful lanterns that glow in the dark. Everyone looks up at the full moon and tells stories about the moon goddess!"
    }
  ],
  "food": [
    {
      "title": "Dumplings",
      "imgRef": "food_dumpling",
      "sfx": "yum",
      "copy": "Dumplings are like little pillows filled with yummy surprises! Families make them together, folding the dough into half-moon shapes. Inside you might find meat, vegetables, or even sweet fillings. People eat dumplings during Chinese New Year because they look like ancient gold coins!"
    },
    {
      "title": "Noodles",
      "imgRef": "food_noodles",
      "sfx": "slurp",
      "copy": "In China, noodles are very special! Long noodles mean long life, so people never cut them. You can slurp them loudly - it's okay! Some noodles are thick and chewy, others are thin and slippery. They come in soup or stir-fried with vegetables and meat!"
    },
    {
      "title": "Mooncakes",
      "imgRef": "food_mooncake",
      "sfx": "ding",
      "copy": "Mooncakes are round like the full moon! They have beautiful patterns pressed on top. Inside is sweet paste made from beans or lotus seeds. Sometimes there's even a salty egg yolk in the middle! Families share mooncakes during the Moon Festival to show they care about each other."
    }
  ],
  "animals": [
    {
      "title": "Giant Panda",
      "imgRef": "animal_panda",
      "sfx": "munch",
      "copy": "Giant pandas are China's most famous animals! They're big and fluffy with black and white fur. Pandas spend most of their day munching on bamboo - they can eat for 12 hours! Baby pandas are tiny, pink, and have no fur. They love to roll, climb, and play. Pandas are very special and live in misty mountains!"
    },
    {
      "title": "Red Panda",
      "imgRef": "animal_red_panda",
      "sfx": "chirp",
      "copy": "Red pandas are like cute teddy bears with bushy tails! They're much smaller than giant pandas. Their reddish-brown fur keeps them warm in cold mountains. Red pandas use their long tails like blankets when they sleep. They love to eat bamboo leaves and sweet berries. Watch them climb trees - they're amazing!"
    },
    {
      "title": "Golden Monkey",
      "imgRef": "animal_monkey",
      "sfx": "hoo",
      "copy": "Golden monkeys have bright golden-orange fur that shines in the sun! They live high up in snowy mountains with their families. These monkeys have funny blue faces and tiny noses. They jump from tree to tree and love to play together. Baby monkeys ride on their mother's backs!"
    }
  ],
  "landmarks": [
    {
      "title": "The Great Wall",
      "imgRef": "landmark_wall",
      "sfx": "wind",
      "copy": "The Great Wall is SO long, you could walk on it for months! It was built a very long time ago to protect China. The wall goes up and down mountains like a giant dragon. You can see it winding through green hills and forests. Imagine all the people who worked together to build something so amazing!"
    },
    {
      "title": "Terracotta Warriors",
      "imgRef": "landmark_warriors",
      "sfx": "stone",
      "copy": "Deep underground, there's an army of clay soldiers! Thousands of them stand in rows, each one different. They were made over 2,000 years ago to protect an emperor. Some warriors ride horses, others hold weapons. They were buried and forgotten until farmers found them by accident. It's like a hidden treasure!"
    }
  ],
  "clothing": [
    {
      "title": "Qipao",
      "imgRef": "clothing_qipao",
      "sfx": "swish",
      "copy": "The qipao is a beautiful dress with a high collar and pretty buttons down the side! It's usually made from smooth, shiny silk with colorful flower patterns. The dress fits snugly and sometimes has special knots called 'frog buttons.' Women wear qipaos for special celebrations. Each design tells a story with dragons, flowers, or birds!"
    },
    {
      "title": "Hanfu",
      "imgRef": "clothing_hanfu",
      "sfx": "swirl",
      "copy": "Hanfu are ancient Chinese robes that flow when you move! They have wide sleeves that look like wings. People wore hanfu thousands of years ago. The robes come in many beautiful colors - red for celebrations, blue like the sky, or white like clouds. Wearing hanfu makes you feel like a prince or princess from long ago!"
    }
  ],
  "phrases": [
    {
      "zh": "你好",
      "pinyin": "Nǐ hǎo",
      "kid": "nee how",
      "en": "Hello",
      "audio": "nihao.mp3"
    },
    {
      "zh": "谢谢",
      "pinyin": "Xièxie",
      "kid": "shyeh-shyeh",
      "en": "Thank you",
      "audio": "xiexie.mp3"
    },
    {
      "zh": "再见",
      "pinyin": "Zàijiàn",
      "kid": "dz-eye jyen",
      "en": "Goodbye",
      "audio": "zaijian.mp3"
    },
    {
      "zh": "请",
      "pinyin": "Qǐng",
      "kid": "ching",
      "en": "Please",
      "audio": "qing.mp3"
    },
    {
      "zh": "好的",
      "pinyin": "Hǎo de",
      "kid": "how duh",
      "en": "Okay",
      "audio": "haode.mp3"
    },
    {
      "zh": "我叫…",
      "pinyin": "Wǒ jiào…",
      "kid": "waw jyao",
      "en": "My name is…",
      "audio": "wojiao.mp3"
    },
    {
      "zh": "熊猫",
      "pinyin": "Xióngmāo",
      "kid": "shyong-maow",
      "en": "Panda",
      "audio": "xiongmao.mp3"
    },
    {
      "zh": "一二三四五",
      "pinyin": "Yī Èr Sān Sì Wǔ",
      "kid": "ee are san ss woo",
      "en": "1–5",
      "audio": "numbers1_5.mp3"
    }
  ],
  "funFacts": [
    "Pandas love bamboo.",
    "Red is a lucky color.",
    "Dragon boats race to drums.",
    "Lanterns make warm light.",
    "The Great Wall twists over hills.",
    "Chopsticks are little sticks.",
    "Families share many small dishes.",
    "Mooncakes are round like the moon."
  ]
}
